{
  "Version": "001",
  "Year": "2024",
  "Semester": "Spring",
  "project_name": "Predicting Educational Outcomes",
  "Objective": " \n            I want to proedict educational outcome based on demographic information, socio-economic factors, and educational history.\n            ",
  "Dataset": "\n            I will be using https://nces.ed.gov/.  I will also be using https://www.census.gov/data.html.\n            ",
  "Rationale": "\n            This predictive model aims to assist agencies and schools in identifying effective strategies to enhance satisfactory educational outcomes. By understanding the key factors influencing success, tailored interventions can be implemented.\n            ",
  "Approach": "\n            1. Data Collection and Cleaning:\n            - Retrieve relevant data from specified sources and conduct thorough cleaning to address missing values, outliers, and inconsistencies.\n            \n            2. Feature Engineering and Selection:\n            - Perform exploratory data analysis and consider creating new features and employ techniques for selecting the most impactful variables.\n            \n            3. Data Integration:\n            - Merge the datasets together into one file, ensuring alignment of key variables and coherent representation.\n            \n            4. Training Set Development:\n            - Construct a representative training data set.\n            \n            5. Model Selection and Iterative Development:\n            - Experiment with different machine learning algorithms, emphasizing iterative development for optimal model selection.\n            \n            6. Cross-Validation and Hyperparameter Tuning:\n            - Implement cross-validation techniques to ensure model generalization, and fine-tune hyperparameters for optimal performance.\n            \n            7. Performance Metrics and Model Interpretability:\n            - Utilize model performance metrics for accurate evaluation and ensure the interpretability of the model for insights into predictive factors.\n            ",
  "Timeline": "\n            This a rough time line for this project:  \n\n            - (2 Weeks) Data Collection and Cleaning\n            - (2 Weeks) Feature Engineering and Selection\n            - (3 Weeks) Data Integration and Training Set Formation\n            - (2 Weeks) Model Selection and Iterative Development\n            - (3 Weeks) Cross-Validation, Hyperparameter Tuning, and Evaluation\n            ",
  "Expected Number Students": "\n            For this project maximum 4 students can work on it.  \n            ",
  "Possible Issues": "\n            The challenge is improving the accuracy of the algorithm.\n            ",
  "Proposed by": "Aidan Smith",
  "Proposed by email": "aidansmith@gwmail.gwu.edu",
  "instructor": "Edwin Lo",
  "instructor_email": "edwinlo@email.gwu.edu",
  "github_repo": "https://github.com/Aidan-Smith92/CapstoneProposal"
}